/***************************************************************************************************
 * @Description: 内部模式管理：创建集合并开启内部模式
 * @ATCaseID: schema_1
 * @Author: Zhou Hongye
 * @TestlinkCase: 无（由测试人员维护，在测试阶段如果有测试场景引用本和例，则在此处填写 Testlink 用例编号，
 *                    并在 Testlink 系统中标记本用例文件名）
 * @Change Activity:
 * Date       Who         Description
 * ========== =========== =========================================================
 * 02/09/2023 Zhou Hongye Enable internal schema when create collection
 **************************************************************************************************/

/*********************************************测试用例***********************************************
 * 环境准备：正常集群环境即可
 * 测试场景：
 *    内部模式管理：创建集合并开启内部模式
 * 测试步骤：
 *    1.创建集合并指定开启内部模式
 *
 * 期望结果：
 *    操作成功，查看集合元数据，属性中标识已开启内部模式
 *
 **************************************************************************************************/
testConf.clName = "schema_1";
testConf.clOpt = { EnableInfoSchema: true };
main(test);

function test() {
  checkIfInfoSchemaEnabled(db, testConf.csName, testConf.clName);
}