/***************************************************************************************************
 * @Description: $month作用于字符串类型字段
 * @ATCaseID: month_at_4
 * @Author: Huang Youquan
 * @TestlinkCase: 无
 * @Change Activity:
 * Date       Who           Description
 * ========== ============= =========================================================
 * 03/30/2023 Huang Youquan    Init
 **************************************************************************************************/

/*********************************************测试用例***********************************************
 * 环境准备：正常集群
 * 测试场景：
 *     $month作用于字符串类型字段
 * 测试步骤：
 *    1. $month作为选择符, 发起查询
 *    2. $month作为匹配符, 发起查询
 * 期望结果：
 *    期望结果与实际结果一致
 *
 **************************************************************************************************/

testConf.clName = COMMCLNAME + "month_at_4";

main(test);
function test(testPara) {
  var dbcl = testPara.testCL;
  var docs = [
    { a: "0000-01-01" },
    { a: "9999-12-31" },
    { a: "2019-02-28" },
    { a: "2020-02-29" },
    { a: "0999-3-31" },
    { a: "0111-4-27" },
    { a: "0099-5-31" },
    { a: "0011-06-27" },
    { a: "0001-07-11" },
    { a: "0009-08-19" },
    {
      a: ["0001-07-31", "0009-08-27"],
    },
    // invalid format
    { a: "000-01-01" },
    { a: "2019-01-00" },
    { a: "2019-00-10" },
    { a: "2019-02-29" },
    { a: "0-02-11" },
    { a: "10000-01-01" },
    { a: "abc" },
    { a: "1902-01-01-00:00:00.000000" },
    {
      a: ["0001-12-31", "009-02-27"],
    },
  ];
  dbcl.insert(docs);

  var actResult;
  var expResult;

  actResult = dbcl.find({}, { a: { $month: 1 } });
  expResult = [
    { a: 1 },
    { a: 12 },
    { a: 2 },
    { a: 2 },
    { a: 3 },
    { a: 4 },
    { a: 5 },
    { a: 6 },
    { a: 7 },
    { a: 8 },
    { a: [7, 8] },
    { a: null },
    { a: null },
    { a: null },
    { a: null },
    { a: null },
    { a: null },
    { a: null },
    { a: null },
    { a: [12, null] },
  ];
  commCompareResults(actResult, expResult);

  actResult = dbcl.find({ a: { $month: 1, $et: 7 } });
  expResult = [
    { a: "0001-07-11" },
    {
      a: ["0001-07-31", "0009-08-27"],
    },
  ];
  commCompareResults(actResult, expResult);
}
