/***************************************************************************************************
 * @Description: $year作用于number类型字段
 * @ATCaseID: year_at_5
 * @Author: Huang Youquan
 * @TestlinkCase: 无
 * @Change Activity:
 * Date       Who           Description
 * ========== ============= =========================================================
 * 03/30/2023 Huang Youquan    Init
 **************************************************************************************************/

/*********************************************测试用例***********************************************
 * 环境准备：正常集群
 * 测试场景：
 *     $year作用于number类型字段
 * 测试步骤：
 *    1. $year作为选择符, 发起查询
 *    2. $year作为匹配符, 发起查询
 * 期望结果：
 *    期望结果与实际结果一致
 *
 **************************************************************************************************/
testConf.clName = COMMCLNAME + "year_at_5";

main(test);
function test(testPara) {
  var dbcl = testPara.testCL;
  var docs = [
    { a: 0 },
    { a: 1 },
    { a: 2147483647 },
    { a: -1 },
    { a: -2147483648 },
    { a: { $numberLong: "3000000000" } },
    { a: { $numberLong: "9223372036854775807" } },
    { a: { $numberLong: "-3000000000" } },
    { a: { $numberLong: "-9223372036854775808" } },
    { a: 123.456 },
    { a: 1.7e308 },
    { a: -123.456 },
    { a: -1.7e308 },
    { a: 1.7e308 },
    { a: { $decimal: "123.456" } },
    { a: { $decimal: "9223372036854775807" } },
    { a: { $decimal: "-9223372036854775808" } },
    { a: { $decimal: "9223372036854775808" } },
    { a: { $decimal: "-9223372036854775809" } },
    { a: [0, 1] },
  ];
  dbcl.insert(docs);

  var actResult;
  var expResult;

  actResult = dbcl.find({}, { a: { $year: 1 } });
  expResult = [
    { a: 1970 },
    { a: 1970 },
    { a: 2038 },
    { a: 1970 },
    { a: 1901 },
    { a: 1970 },
    { a: 292278994 },
    { a: 1969 },
    { a: -292275055 },
    { a: 1970 },
    { a: -292275055 },
    { a: 1970 },
    { a: -292275055 },
    { a: -292275055 },
    { a: 1970 },
    { a: 292278994 },
    { a: -292275055 },
    { a: null },
    { a: null },
    { a: [1970, 1970] },
  ];
  commCompareResults(actResult, expResult);

  actResult = dbcl.find({ a: { $year: 1, $et: 2038 } });
  expResult = [{ a: 2147483647 }];
  commCompareResults(actResult, expResult);
}
