/***************************************************************************************************
 * @Description: $year作用于字符串类型字段
 * @ATCaseID: year_at_4
 * @Author: Huang Youquan
 * @TestlinkCase: 无
 * @Change Activity:
 * Date       Who           Description
 * ========== ============= =========================================================
 * 03/30/2023 Huang Youquan    Init
 **************************************************************************************************/

/*********************************************测试用例***********************************************
 * 环境准备：正常集群
 * 测试场景：
 *     $year作用于字符串类型字段
 * 测试步骤：
 *    1. $year作为选择符, 发起查询
 *    2. $year作为匹配符, 发起查询
 * 期望结果：
 *    期望结果与实际结果一致
 *
 **************************************************************************************************/

testConf.clName = COMMCLNAME + "year_at_4";

main(test);
function test(testPara) {
  var dbcl = testPara.testCL;
  var docs = [
    { a: "0000-01-01" },
    { a: "9999-12-31" },
    { a: "2019-02-28" },
    { a: "2020-02-29" },
    { a: "0999-12-31" },
    { a: "0111-02-27" },
    { a: "0099-12-31" },
    { a: "0011-02-27" },
    { a: "0001-12-31" },
    { a: "0009-02-27" },
    {
      a: ["0001-12-31", "0009-02-27"],
    },
    // invalid format
    { a: "000-01-01" },
    { a: "2019-01-00" },
    { a: "2019-00-10" },
    { a: "2019-02-29" },
    { a: "0-02-11" },
    { a: "10000-01-01" },
    { a: "abc" },
    { a: "1902-01-01-00:00:00.000000" },
    {
      a: ["0001-12-31", "009-02-27"],
    },
  ];
  dbcl.insert(docs);

  var actResult;
  var expResult;

  actResult = dbcl.find({}, { a: { $year: 1 } });
  expResult = [
    { a: 0 },
    { a: 9999 },
    { a: 2019 },
    { a: 2020 },
    { a: 999 },
    { a: 111 },
    { a: 99 },
    { a: 11 },
    { a: 1 },
    { a: 9 },
    { a: [1, 9] },
    { a: null },
    { a: null },
    { a: null },
    { a: null },
    { a: null },
    { a: null },
    { a: null },
    { a: null },
    { a: [1, null] },
  ];
  commCompareResults(actResult, expResult);

  actResult = dbcl.find({ a: { $year: 1, $et: 9 } });
  expResult = [
    { a: "0009-02-27" },
    {
      a: ["0001-12-31", "0009-02-27"],
    },
  ];
  commCompareResults(actResult, expResult);
}
